"""
1.Система досягнень

Користувач отримує achievements за свої дії:
Перший перегляд
"Ви переглянули свій перший фільм!"
Кіноман
"Ви переглянули 10 фільмів"
Критик
"Ви оцінили 10 фільмів"
Колекціонер
"Ви додали 10 фільмів до обраного"
Фантаст
"Ви переглянули 5 фантастичних фільмів"


2. «Користувачі зі схожими смаками»
Знайдемо користувача, який має схожі оцінки.
Наприклад:

Bob:
Interstellar  10
Inception      9
Matrix         9
Dune           7

Anna:
Interstellar   9
Inception      10
Matrix          9
Dune            8


Система визначає:
Найбільш схожий користувач:

Anna
Схожість: 87%


3. Trending
Можна додати поняття популярності за останні 7 днів.
Наприклад:
TRENDING NOW
1. Dune              142 перегляди
2. Interstellar      127 переглядів
3. Inception          98 переглядів
4. Matrix              91 перегляд


4. Статистика по актору, та рекомендаціі для перегляду
Leonardo DiCaprio

Фільмів у каталозі: 8
Загальна кількість переглядів: 1 284
Середній рейтинг: 8.7

А потім:
Інші фільми цього актора:
• The Revenant
• Titanic
• Shutter Island



5. «Кіноплан на вечір»

Користувач вводить:
У мене є 4 години.

Система шукає комбінацію фільмів:
Interstellar       169 хв
Arrival             116 хв
The Matrix          136 хв
-------------------------
Разом               421 хв

Тоді:
Interstellar       169 хв
Arrival             116 хв
-------------------------
Разом               285 хв

Залишилося: 135 хв
І шукає третій фільм, який поміщається.

ВАШ КІНОВЕЧІР
20:00 — Interstellar
22:49 — Arrival
00:45 — The Matrix
Загальний час: 421 хв
"""